"""==================================================================================================================
3. Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
Класс-исключение должен контролировать типы данных элементов списка.
===================================================================================================================="""
class TypeError(Exception):
    def __init__(self, txt):
        self.txt = txt

UsersInput = []
while True:
    try:
        x = input('Введите натуральное число либо нажмите Enter, чтобы прекратить:')
        if x == '':
            break
        if x.isnumeric():
            print('numeric ',x)
            UsersInput.append(int(x))
        elif x[0] == '-':
            if x[1:].isnumeric():
                print('negative - ',x[1:])
                UsersInput.append(int(x))
        else:
            raise TypeError('Это не натуральное число!')
    except TypeError as TypeError:
        print(TypeError)
print(UsersInput)
