"""===========================================================================================
2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
имя, фамилия, год рождения, город проживания, email, телефон.
Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.
==========================================================================================="""
# Добавление функции user_division из модуля Functions
from Functions import print_user_data
from Functions import print_user_data_input

if __name__ == '__main__':
    # Вывод информации в консоль
    # ==================================== Вариант 1 ====================================
    print('========== Задание 2 урок 3. Функция вывода информации по пользователю. Вариант 1')
    # Добавление информации по пользователю
    user = {
        'name': 'Aleksandr',
        'surname': '-',
        'birth_year': '1991',
        'city': 'Moscow',
        'email': 'Sasha@geekbrains.ru',
        'phone': '111111111111'
    }
    # Вывод данных по пользователю с помощью пользовательской функции print_user_data из модуля Functions
    print_user_data(**user)

    # ==================================== Вариант 2 ====================================
    print('==========  Задание 2 урок 3. Функция вывода информации по пользователю c вводом данных от пользователя. Вариант 2')
    print(print_user_data_input(name=input('Enter name: '),
                s_name=input('Enter second name: '),
                b_date=input('Enter birth day: '),
                l_town=input('Enter live town: '),
                email=input('Enter email: '),
                tel=input('Enter tel number: ')))