"""=====================================================================================================================
5. Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных пробелами.
Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.
====================================================================================================================="""

if __name__ == "__main__":
    print(f'========== Задание 5 ===========')
    with open("Task05.txt", "w+") as user_file:
        while True:
            try:
                line = input('Введите числа через пробел >>>')
                user_file.writelines(line)
                # Преобразовываем элементы списка в float
                numbers = map(float, line.split())
                print(f'Сумма введенных чисел равна: {sum(numbers)}')
                break
            except ValueError:
                print(f'Некорректный ввод. Введите два числа через пробел')
                continue