"""=====================================================================================================================
2. Создать текстовый файл (не программно), сохранить в нем несколько строк,
выполнить подсчет количества строк, количества слов в каждой строке.
====================================================================================================================="""
import sys

# Создание наименование файла
FILENAME = "Task02.txt"

if __name__ == "__main__":
    print(f'========== Задание 2 ===========')
    try:
        with open(FILENAME, encoding='utf-8') as user_file:
            # Читаем содержимое файла
            file = user_file.read()
            # Выводим содежимое файла
            print(f'Cодержимое файла: \n------------------\n{file}\n------------------')
            # Перемещаем курсор в начало файла
            user_file.seek(0)
            # Считаем количество строк
            lines = [line for line in user_file.readlines() if line != '\n']
            # Выводим информацию
            print(f"В файле непустых строк:", len(lines))
            # Перемещаем курсор в начало файла
            user_file.seek(0)
            for i in range(len(lines)):
                # Читаем строку
                line = user_file.readline()
                # Определяем слова
                words = line.split()
                print(f'Количество слов в {i + 1}-ой строке: {len(words)} ')
    except IOError as file_n_found:
        print(file_n_found)
        sys.exit(1)

