"""
3. Пользователь вводит месяц в виде целого числа от 1 до 12.
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
"""
# ====================================== Создаем список
season_list = [
    ['Зима', ['1', '2', '12']],
    ['Весна', ['3', '4', '5']],
    ['Лето', ['6', '7', '8']],
    ['Осень', ['9', '10', '11']]
]
# ====================================== Создаем словарь
season_dict = {
    'Зима': ['1', '2', '12'],
    'Весна': ['3', '4', '5'],
    'Лето': ['6', '7', '8'],
    'Осень': ['9', '10', '11']
}
# ====================================== Проверка введенного числа
while True:
    user_month = input("Введите номер месяца от 1 до 12: ")
    if user_month not in sum(season_dict.values(), []):  # объединение значений в список с помощью функции sum
        # print(sum(season_dict.values(), []))
        print('Неправильно введенный номер месяца! Повторите ввод.')
        continue
    break
# ====================================== Перебор последовательностей в списке с помощью цикла for in
for season, month in season_list:
    if user_month in month:
        print(f'Определение через список:\n         Месяц с номером {user_month} - это {season}!') # символ новой строки \n
# ====================================== Перебор последовательностей в словаре
for season,month in season_dict.items():
    if user_month in month:
        print(f'Определение через словарь:\n        Месяц с номером {user_month} - это {season}!') #


# ========================================="Громоздое" решение==============================
# while True:
#     try:
#         user_month = int(input("Введите число от 1 до 12: "))
#         if user_month < 1 or user_month > 12:
#             raise Exception
#         if user_month == 12 or user_month == 1 or user_month == 2:
#             print('Это', Season[0])
#             break
#         if 3 <= user_month <= 5:
#             print('Это', Season[1])
#             break
#         if 6 <= user_month <= 8:
#             print('Это', Season[3])
#             break
#         if 9 <= user_month <= 11:
#             print('Это', Season[4])
#             break
#     except ValueError:
#         print('Неверный формат данных!')
#     except Exception:
#         print('Число должно лежать в диапазоне от 1 до 12!')