"""=====================================================================================================================
Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах*ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
====================================================================================================================="""
from sys import argv


def user_salary(hours, bid, bonus):
    """
    Функция расчета заработной платы сотруника
    :param hours: Выработка в часах
    :param bid: Ставка
    :param bonus: Премия
    :return: Заработная плата сотрудника
    """
    salary = hours * bid + bonus
    return salary


name, hours, bid, bonus = argv
print(f'Выроботка в часах сотрудника: {hours}')
print(f'Ставка в час сотрудника: {bid}')
print(f'Премия: {bonus}')
print(f'Заработная плата сотрудника: {user_salary(float(hours), float(bid), float(bonus))}')
