"""=====================================================================================================================
2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].
====================================================================================================================="""

result_list = []
# list = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
list = [int(i) for i in input("Введите список чисел: ").split()]
result_list = [number for i, number in enumerate(list) if i > 0 and list[i] > list[i - 1]]
# result_list = [num1 for num1, num2 in zip(in_list[1:], in_list[:-1]) if num1 > num2]
# -----------Циклом
# for i in range(1, len(list)):
#     if list[i] > list[i-1]:
#         (result_list.append(list[i]))
#--------------------------
print("Исходный список: ", list)
print("Список, элементы которого больше предыдущего: ", result_list)

# res_list = [num1 for num1, num2 in zip(in_list[1:], in_list[:-1]) if num1 > num2]
