"""=====================================================================================================================
5. Реализовать формирование списка, используя функцию range() и возможности генератора.
В список должны войти четные числа от 100 до 1000 (включая границы).
Необходимо получить результат вычисления произведения всех элементов списка.
Подсказка: использовать функцию reduce().
====================================================================================================================="""
from functools import reduce

# ===================================== Через функцию ======================================
# Формирование списка
original_list = [el for el in range(100, 1001) if el % 2 == 0]
print(original_list)

def multiplication(param_1, param_2):
    """
    Выводит результат вычисления произведения всех элементов списка
    :param param_1: Параметр 1
    :param param_2: Параметр 2
    :return: Произведение двух элементов
    """
    return param_1 * param_2

print(f'============== Вариант 1 ==============\n'
      f'Произведение четных чисел от 100 до 1000 (включая границы) составляет:\n {reduce(multiplication, original_list)}')
# ===========================================================================================
result = reduce(lambda multpl, i: multpl * i, range(100, 1001, 2))
print(f'============== Вариант 2 ==============\n'
      f'Произведение четных чисел от 100 до 1000 (включая границы) составялет:\n {result}')