"""=====================================================================================================================
4. Представлен список чисел. Определить элементы списка, не имеющие повторений.
Сформировать итоговый массив чисел, соответствующих требованию.
Элементы вывести в порядке их следования в исходном списке. Для выполнения задания обязательно использовать генератор.
Пример исходного списка: [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11].
Результат: [23, 1, 3, 10, 4, 11]
====================================================================================================================="""
# original_list = [2, 2, 2, 7, 23, 1, 44, 44, 3, 2, 10, 7, 4, 11]
while True:
    try:
        original_list = [int(i) for i in input("Введите числа, разделя их пробелом: ").split()]
        break
    except ValueError:
        print(f'Некорректный тип данных. Повторите ввод.')
        continue
result_list = [el for el in original_list if original_list.count(el) == 1]
print(f'Результат: {result_list}')